field {
    cols 20
    rows 20
}

snake {
    tickMs 150
    winLength 10
}

food {
    count 3
}

activeLevel 'walls'

// На самом деле вместо точек можно использовать всё что угодно,
// но # для обозначения стен обязательны.
level('default') {
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
    row '.....................'
}

level('walls') {
    row '####################'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '#..................#'
    row '####################'
}

colors {
    background '#000000'
    wall '#D69C2F'
    food '#F03E3E'
    snakeHead '#08715B'
    snakeBody '#20C997'
}

window {
    title 'Змейка'
    width 620
    height 660
    minWidth 300
    minHeight 300
}

ui {
    statusPaused 'Пауза - нажмите E для продолжения'
    statusWin 'Победа! Нажмите R для новой игры'
    statusLose 'Проигрыш! Нажмите R для новой игры'
    statusRunning 'Тестовая строка: %d / %d'
}
